In [84]:
# Importing packages
import psycopg2
import pandas as pd

In [85]:
#Method to connect to DB
def connectDB():
    #create a connection
    conn = psycopg2.connect(
    host="localhost",
    database="dvdrental",
    user="postgres",
    password="gremio")

    #create a cursor
    cur = conn.cursor()
    print("Connected")
    return conn, cur

In [86]:
#Selecting the data

def selectData(sql_select):
    #input = Query
    cur.execute(sql_select)
    data = cur.fetchall()

    #showing
    #x = input("Wanna print the data? Press 1 ==>> ____")
    #if x==1:
        #for line in data:
            #print(line)
    return data

In [87]:
#Select all Tables Names
def selectTables(t_schema):
    s = ""
    s += "SELECT"
    s += " table_schema"
    s += ", table_name"
    s += " FROM information_schema.tables"
    s += " WHERE"
    s += " ("
    s += " table_schema = 'public'"
    s += " )"
    s += " ORDER BY table_schema, table_name;"
    
    cur.execute(s)
    list_tables = cur.fetchall()


    return list_tables

In [88]:
conn, cur = connectDB()
selectTables('public')

Connected

[('public', 'actor'),
 ('public', 'actor_info'),
 ('public', 'address'),
 ('public', 'category'),
 ('public', 'city'),
 ('public', 'country'),
 ('public', 'customer'),
 ('public', 'customer_list'),
 ('public', 'film'),
 ('public', 'film_actor'),
 ('public', 'film_category'),
 ('public', 'film_list'),
 ('public', 'inventory'),
 ('public', 'language'),
 ('public', 'nicer_but_slower_film_list'),
 ('public', 'payment'),
 ('public', 'rental'),
 ('public', 'sales_by_film_category'),
 ('public', 'sales_by_store'),
 ('public', 'staff'),
 ('public', 'staff_list'),
 ('public', 'store')]

In [89]:
#closing cursor and connections
cur.close()
conn.close()

In [90]:
#Putting all tables into DF
conn, cur = connectDB()

tables = selectTables('public')
list_tables = []

for i,v in tables:
    #print(i)
    #print(v)
    list_tables.append(v) #put only table name, not schema name

Connected

In [91]:
list_tables

['actor',
 'actor_info',
 'address',
 'category',
 'city',
 'country',
 'customer',
 'customer_list',
 'film',
 'film_actor',
 'film_category',
 'film_list',
 'inventory',
 'language',
 'nicer_but_slower_film_list',
 'payment',
 'rental',
 'sales_by_film_category',
 'sales_by_store',
 'staff',
 'staff_list',
 'store']

In [92]:
#put all tables on a list of DataFrames
list_df = []
for i in range(0,len(list_tables)):
    conn, cur = connectDB()
    sql_query = "SELECT * from %s" %(list_tables[i])
    #print(sql_query)
    data = selectData(sql_query) #use the query to find data
    
    colnames = [desc[0] for desc in cur.description]
    df = pd.DataFrame(data, columns=colnames)
    list_df.append(df)
    cur.close()
    conn.close()

Connected
Connected
Connected
Connected
Connected
Connected
Connected
Connected
Connected
Connected
Connected
Connected
Connected
Connected
Connected
Connected
Connected
Connected
Connected
Connected
Connected
Connected

In [93]:
len(list_df)

22

In [100]:
list_df[0] #picking first DF

     actor_id first_name     last_name             last_update
0           1   Penelope       Guiness 2013-05-26 14:47:57.620
1           2       Nick      Wahlberg 2013-05-26 14:47:57.620
2           3         Ed         Chase 2013-05-26 14:47:57.620
3           4   Jennifer         Davis 2013-05-26 14:47:57.620
4           5     Johnny  Lollobrigida 2013-05-26 14:47:57.620
..        ...        ...           ...                     ...
195       196       Bela        Walken 2013-05-26 14:47:57.620
196       197      Reese          West 2013-05-26 14:47:57.620
197       198       Mary        Keitel 2013-05-26 14:47:57.620
198       199      Julia       Fawcett 2013-05-26 14:47:57.620
199       200      Thora        Temple 2013-05-26 14:47:57.620

[200 rows x 4 columns]

In [107]:
list_df[-1] #picking last DF

   store_id  manager_staff_id  address_id         last_update
0         1                 1           1 2006-02-15 09:57:12
1         2                 2           2 2006-02-15 09:57:12

In [96]:
#example connection just in one table
conn, cur = connectDB()

# Querys #Select
sql_select = "select * from actor"

connectDB() #connect with DB

data = selectData(sql_select) #use the query to find data
colnames = [desc[0] for desc in cur.description]
df = pd.DataFrame(data, columns = colnames)


df

Connected
Connected

     actor_id first_name     last_name             last_update
0           1   Penelope       Guiness 2013-05-26 14:47:57.620
1           2       Nick      Wahlberg 2013-05-26 14:47:57.620
2           3         Ed         Chase 2013-05-26 14:47:57.620
3           4   Jennifer         Davis 2013-05-26 14:47:57.620
4           5     Johnny  Lollobrigida 2013-05-26 14:47:57.620
..        ...        ...           ...                     ...
195       196       Bela        Walken 2013-05-26 14:47:57.620
196       197      Reese          West 2013-05-26 14:47:57.620
197       198       Mary        Keitel 2013-05-26 14:47:57.620
198       199      Julia       Fawcett 2013-05-26 14:47:57.620
199       200      Thora        Temple 2013-05-26 14:47:57.620

[200 rows x 4 columns]

Connected
None